GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.h
/*
 * Copyright (c) 2020-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#ifndef BLE_H
#define BLE_H

#include <Arduino.h>
#include <type_traits>

#include "stm32wb_fwu.h"

enum BLEOption : uint32_t {
    BLE_OPTION_RANDOM_STATIC_ADDRESS                         = 0x00000001,
    BLE_OPTION_PRIVACY                                       = 0x00000002,
    BLE_OPTION_NO_SERVICE_CHANGED                            = 0x00000004,
    BLE_OPTION_READ_ONLY_DEVICE_NAME                         = 0x00000008,
};


enum BLEAppearance : uint16_t {
    BLE_APPEARANCE_UNKNOWN                                   = 0,
    BLE_APPEARANCE_GENERIC_PHONE                             = 64,
    BLE_APPEARANCE_GENERIC_COMPUTER                          = 128,
    BLE_APPEARANCE_GENERIC_WATCH                             = 192,
    BLE_APPEARANCE_WATCH_SPORTS_WATCH                        = 193,
    BLE_APPEARANCE_GENERIC_CLOCK                             = 256,
    BLE_APPEARANCE_GENERIC_DISPLAY                           = 320,
    BLE_APPEARANCE_GENERIC_REMOTE_CONTROL                    = 384,
    BLE_APPEARANCE_GENERIC_EYE_GLASSES                       = 448,
    BLE_APPEARANCE_GENERIC_TAG                               = 512,
    BLE_APPEARANCE_GENERIC_KEYRING                           = 576,
    BLE_APPEARANCE_GENERIC_MEDIA_PLAYER                      = 640,
    BLE_APPEARANCE_GENERIC_BARCODE_SCANNER                   = 704,
    BLE_APPEARANCE_GENERIC_THERMOMETER                       = 768,
    BLE_APPEARANCE_THERMOMETER_EAR                           = 769,
    BLE_APPEARANCE_GENERIC_HEART_RATE_SENSOR                 = 832,
    BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT         = 833,
    BLE_APPEARANCE_GENERIC_BLOOD_PRESSURE                    = 896,
    BLE_APPEARANCE_BLOOD_PRESSURE_ARM                        = 897,
    BLE_APPEARANCE_BLOOD_PRESSURE_WRIST                      = 898,
    BLE_APPEARANCE_GENERIC_HID                               = 960,
    BLE_APPEARANCE_HID_KEYBOARD                              = 961,
    BLE_APPEARANCE_HID_MOUSE                                 = 962,
    BLE_APPEARANCE_HID_JOYSTICK                              = 963,
    BLE_APPEARANCE_HID_GAMEPAD                               = 964,
    BLE_APPEARANCE_HID_DIGITIZERSUBTYPE                      = 965,
    BLE_APPEARANCE_HID_CARD_READER                           = 966,
    BLE_APPEARANCE_HID_DIGITAL_PEN                           = 967,
    BLE_APPEARANCE_HID_BARCODE                               = 968,
    BLE_APPEARANCE_GENERIC_GLUCOSE_METER                     = 1024,
    BLE_APPEARANCE_GENERIC_RUNNING_WALKING_SENSOR            = 1088,
    BLE_APPEARANCE_RUNNING_WALKING_SENSOR_IN_SHOE            = 1089,
    BLE_APPEARANCE_RUNNING_WALKING_SENSOR_ON_SHOE            = 1090,
    BLE_APPEARANCE_RUNNING_WALKING_SENSOR_ON_HIP             = 1091,
    BLE_APPEARANCE_GENERIC_CYCLING                           = 1152,
    BLE_APPEARANCE_CYCLING_CYCLING_COMPUTER                  = 1153,
    BLE_APPEARANCE_CYCLING_SPEED_SENSOR                      = 1154,
    BLE_APPEARANCE_CYCLING_CADENCE_SENSOR                    = 1155,
    BLE_APPEARANCE_CYCLING_POWER_SENSOR                      = 1156,
    BLE_APPEARANCE_CYCLING_SPEED_CADENCE_SENSOR              = 1157,
    BLE_APPEARANCE_GENERIC_PULSE_OXIMETER                    = 3136,
    BLE_APPEARANCE_PULSE_OXIMETER_FINGERTIP                  = 3137,
    BLE_APPEARANCE_PULSE_OXIMETER_WRIST_WORN                 = 3138,
    BLE_APPEARANCE_GENERIC_WEIGHT_SCALE                      = 3200,
    BLE_APPEARANCE_GENERIC_OUTDOOR_SPORTS_ACT                = 5184,
    BLE_APPEARANCE_OUTDOOR_SPORTS_ACT_LOC_DISP               = 5185,
    BLE_APPEARANCE_OUTDOOR_SPORTS_ACT_LOC_AND_NAV_DISP       = 5186,
    BLE_APPEARANCE_OUTDOOR_SPORTS_ACT_LOC_POD                = 5187,
    BLE_APPEARANCE_OUTDOOR_SPORTS_ACT_LOC_AND_NAV_POD        = 5188,
};

enum BLEAdType : uint8_t {
    BLE_AD_TYPE_FLAGS                                        = 0x01,
    BLE_AD_TYPE_16_BIT_SERV_UUID                             = 0x02,
    BLE_AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST                  = 0x03,
    BLE_AD_TYPE_32_BIT_SERV_UUID                             = 0x04,
    BLE_AD_TYPE_32_BIT_SERV_UUID_CMPLT_LIST                  = 0x05,
    BLE_AD_TYPE_128_BIT_SERV_UUID                            = 0x06,
    BLE_AD_TYPE_128_BIT_SERV_UUID_CMPLT_LIST                 = 0x07,
    BLE_AD_TYPE_SHORTENED_LOCAL_NAME                         = 0x08,
    BLE_AD_TYPE_COMPLETE_LOCAL_NAME                          = 0x09,
    BLE_AD_TYPE_TX_POWER_LEVEL                               = 0x0a,
    BLE_AD_TYPE_CLASS_OF_DEVICE                              = 0x0d,
    BLE_AD_TYPE_SLAVE_CONN_INTERVAL                          = 0x12,
    BLE_AD_TYPE_SERV_SOLICIT_16_BIT_UUID_LIST                = 0x14,
    BLE_AD_TYPE_SERV_SOLICIT_128_BIT_UUID_LIST               = 0x15,
    BLE_AD_TYPE_SERVICE_DATA                                 = 0x16,
    BLE_AD_TYPE_APPEARANCE                                   = 0x19,
    BLE_AD_TYPE_ADVERTISING_INTERVAL                         = 0x1a,
    BLE_AD_TYPE_LE_ROLE                                      = 0x1c,
    BLE_AD_TYPE_SERV_SOLICIT_32_BIT_UUID_LIST                = 0x1f,
    BLE_AD_TYPE_MANUFACTURER_SPECIFIC_DATA                   = 0xff
};

enum BLEProperty : uint8_t {
    BLE_PROPERTY_READ                                        = 0x02,
    BLE_PROPERTY_WRITE_WITHOUT_RESPONSE                      = 0x04,
    BLE_PROPERTY_WRITE                                       = 0x08,
    BLE_PROPERTY_NOTIFY                                      = 0x10,
    BLE_PROPERTY_INDICATE                                    = 0x20
};

