GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.h
enum BLEPermission : uint8_t {
    BLE_PERMISSION_READ_UNENCRYPTED                          = 0x00,
    BLE_PERMISSION_READ_UNAUTHENTICATED                      = 0x01,
    BLE_PERMISSION_READ_AUTHENTICATED                        = 0x02,
    BLE_PERMISSION_READ_AUTHENTICATED_SECURE_CONNECTION      = 0x03,
    BLE_PERMISSION_WRITE_UNENCRYPTED                         = 0x00,
    BLE_PERMISSION_WRITE_UNAUTHENTICATED                     = 0x04,
    BLE_PERMISSION_WRITE_AUTHENTICATED                       = 0x08,
    BLE_PERMISSION_WRITE_AUTHENTICATED_SECURE_CONNECTION     = 0x0c,
    BLE_PERMISSION_SUBSCRIBE_UNENCRYPTED                     = 0x00,
    BLE_PERMISSION_SUBSCRIBE_UNAUTHENTICATED                 = 0x10,
    BLE_PERMISSION_SUBSCRIBE_AUTHENTICATED                   = 0x20,
    BLE_PERMISSION_SUBSCRIBE_AUTHENTICATED_SECURE_CONNECTION = 0x30
};

enum BLESecurity : uint8_t {
    BLE_SECURITY_UNENCRYPTED                                 = 0x00,
    BLE_SECURITY_UNAUTHENTICATED                             = 0x01,
    BLE_SECURITY_AUTHENTICATED                               = 0x02,
    BLE_SECURITY_AUTHENTICATED_SECURE_CONNECTION             = 0x03,
};

enum BLEPhy : uint8_t {
    BLE_PHY_1M                                               = 0x01,
    BLE_PHY_2M                                               = 0x02,
    BLE_PHY_CODED                                            = 0x04
};

enum BLEPhyOption : uint16_t {
    BLE_PHY_OPTION_S2                                        = 0x01,
    BLE_PHY_OPTION_S8                                        = 0x02,
};

enum BLEDiscoverable : uint8_t {
    BLE_DISCOVERABLE_LIMITED                                 = 0x01,
    BLE_DISCOVERABLE_GENERAL                                 = 0x02,
};

enum BLEStatus : uint8_t {
    BLE_STATUS_SUCCESS                                       = 0,
    BLE_STATUS_FAILURE                                       = 1,
    BLE_STATUS_BUSY                                          = 255
};
  
enum BLEPayload : uint8_t {
    BLE_PAYLOAD_PRBS9            = 0,
    BLE_PAYLOAD_PATTERN_11110000 = 1,
    BLE_PAYLOAD_PATTERN_10101010 = 2,
    BLE_PAYLOAD_PRBS15           = 3,
    BLE_PAYLOAD_PATTERN_11111111 = 4,
    BLE_PAYLOAD_PATTERN_00000000 = 5,
    BLE_PAYLOAD_PATTERN_00001111 = 6,
    BLE_PAYLOAD_PATTERN_01010101 = 7,
};

class BLEDescriptor {
public:
    BLEDescriptor();
    BLEDescriptor(const char *uuid, uint8_t permissions, const void *value, int valueLength);
    BLEDescriptor(const char* uuid, uint8_t permissions, const char* value);
    BLEDescriptor(const char* uuid, const char* value);
    ~BLEDescriptor();

    BLEDescriptor(const BLEDescriptor &other);
    BLEDescriptor &operator=(const BLEDescriptor &other);
    BLEDescriptor(BLEDescriptor &&other);
    BLEDescriptor &operator=(BLEDescriptor &&other);

    operator bool() const;

    const char *uuid() const;
    uint8_t permissions() const;

    int valueLength() const;
    const void *value() const;
    int getValue(void *value, int length) const;

protected:
    BLEDescriptor(class BLEDescriptorInstance *instance);
    class BLEDescriptorInstance *instance();

    friend class BLEDescriptorInstance;
    
private:
    static BLEDescriptorInstance *instance(const char *uuid, uint8_t permissions, const void *value, int valueLength);

    BLEDescriptorInstance *m_instance;

public:
    template<typename T>
    typename std::enable_if<std::is_standard_layout<T>::value, int>::type
    getValue(T& value) {
        return getValue(reinterpret_cast<void*>(&value), sizeof(T));
    }
};


class BLECharacteristic {
public:
    BLECharacteristic();
    BLECharacteristic(const char *uuid, uint8_t properties, uint8_t permissions, const void *value, int valueLength, int valueSize, bool fixedLength);
    BLECharacteristic(const char *uuid, uint8_t properties, uint8_t permissions, int valueSize, bool fixedLength);
    BLECharacteristic(const char* uuid, uint8_t properties, uint8_t permissions, const char* value);
    BLECharacteristic(const char* uuid, uint8_t properties, const char* value);
    ~BLECharacteristic();

    BLECharacteristic(const BLECharacteristic &other);
    BLECharacteristic &operator=(const BLECharacteristic &other);
    BLECharacteristic(BLECharacteristic &&other);
    BLECharacteristic &operator=(BLECharacteristic &&other);
    
    operator bool() const;

    const char *uuid() const;
    uint8_t properties() const;
    uint8_t permissions() const;
    bool fixedLength() const;

    int valueSize() const;
    int valueLength();
    const void* value();
    int getValue(void *value, int length);

    bool setValue(const void *value, int length);

    bool writeValue(const void *value, int length);
    bool writeValue(const void *value, int length, void(*callback)(void));
    bool writeValue(const void *value, int length, Callback callback);

    uint8_t status();
    bool busy();
    bool written();
    bool subscribed();

    unsigned int descriptorCount();
    BLEDescriptor descriptor(unsigned int index);
    bool addDescriptor(BLEDescriptor &descriptor);
    bool removeDescriptor(BLEDescriptor &descriptor);
    
    void onRead(void(*callback)(void));
    void onRead(Callback callback);
    void onWritten(void(*callback)(void));
    void onWritten(Callback callback);
    void onSubscribed(void(*callback)(void));
    void onSubscribed(Callback callback);
  
protected:
    BLECharacteristic(class BLECharacteristicInstance *instance);
    class BLECharacteristicInstance *instance();

    friend class BLECharacteristicInstance;
    
private:
    static BLECharacteristicInstance *instance(const char *uuid, uint8_t properties, uint8_t permissions, const void *value, int valueLength, int valueSize, bool fixedLength, bool constant);

    BLECharacteristicInstance *m_instance;

public:
    template<typename T>
    BLECharacteristic(const char *uuid, uint8_t properties, const T& value) :
        BLECharacteristic(uuid, properties, 0, reinterpret_cast<const void*>(&value), sizeof(T), sizeof(T), false) { };

