GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.h
    template<typename T>
    BLECharacteristic(const char *uuid, uint8_t properties, uint8_t permissions, const T& value) :
        BLECharacteristic(uuid, properties, permissions, reinterpret_cast<const void*>(&value), sizeof(T), sizeof(T), false) { };
    
    template<typename T>
    typename std::enable_if<std::is_standard_layout<T>::value, int>::type
    getValue(T& value) {
        return getValue(reinterpret_cast<void*>(&value), sizeof(T));
    }
    
    template<typename T>
    typename std::enable_if<std::is_standard_layout<T>::value, bool>::type
    setValue(const T& value) {
        return setValue(reinterpret_cast<const void*>(&value), sizeof(T));
    }
    
    template<typename T>
    typename std::enable_if<std::is_standard_layout<T>::value, bool>::type
    writeValue(const T& value) {
        return writeValue(reinterpret_cast<const void*>(&value), sizeof(T));
    }

    template<typename T>
    typename std::enable_if<std::is_standard_layout<T>::value, bool>::type
    writeValue(const T& value, void(*callback)(void)) {
        return writeValue(reinterpret_cast<const void*>(&value), sizeof(T), callback);
    }

    template<typename T>
    typename std::enable_if<std::is_standard_layout<T>::value, bool>::type
    writeValue(const T& value, Callback callback) {
        return writeValue(reinterpret_cast<const void*>(&value), sizeof(T), callback);
    }
};


class BLEService {
public:
    BLEService();
    BLEService(const char *uuid);
    ~BLEService();

    BLEService(const BLEService &other);
    BLEService &operator=(const BLEService &other);
    BLEService(BLEService &&other);
    BLEService &operator=(BLEService &&other);
    
    operator bool() const;

    const char *uuid() const;

    unsigned int characteristicCount();
    BLECharacteristic characteristic(unsigned int index);
    bool addCharacteristic(BLECharacteristic &characteristic);
    bool removeCharacteristic(BLECharacteristic &characteristic);

    void onConnect(void(*callback)(void));
    void onConnect(Callback callback);
    void onDisconnect(void(*callback)(void));
    void onDisconnect(Callback callback);
  
protected:
    BLEService(class BLEServiceInstance *instance);
    class BLEServiceInstance *instance();

    friend class BLEServiceInstance;
    
private:
    static BLEServiceInstance *instance(const char *uuid);
    
    BLEServiceInstance *m_instance;
};


class BLEDevice {
public:
    BLEDevice();
    ~BLEDevice();

    BLEDevice(const BLEDevice &other);
    BLEDevice &operator=(const BLEDevice &other);
    BLEDevice(BLEDevice &&other);
    BLEDevice &operator=(BLEDevice &&other);
    
    operator bool() const;

    String address() const;
    bool connected();
    int rssi();
    int mtu();

    bool setConnectionInterval(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval);
    bool setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency);
    bool setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout);
    void getConnectionParameters(uint16_t &connectionInterval, uint16_t &slaveLatency, uint16_t &supervisionTimeout); 
    
    void onConnectionUpdate(void(*callback)(void));
    void onConnectionUpdate(Callback callback);
    
protected:
    BLEDevice(class BLEDeviceInstance *instance);
    class BLEDeviceInstance *instance();

    friend class BLEDeviceInstance;
    
private:
    BLEDeviceInstance *m_instance;
};


class BLEClass {
public:
    static bool begin(int mtu = 23, uint32_t options = 0);
    static void end();
    
    static String address();
    
    static bool setTxPowerLevel(int txPower);
    static bool setPreferredPhy(BLEPhy txPhy, BLEPhy rxPhy, BLEPhyOption phyOptions = (BLEPhyOption)0);

    // GAP/GATT Server: Standard Services/Attributes
    static void setDeviceName(const char *deviceName);
    static void setAppearance(BLEAppearance appearance);
    static bool setConnectionInterval(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval);
    static bool setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency);
    static bool setConnectionParameters(uint16_t minimumConnectionInterval, uint16_t maximumConnectionInterval, uint16_t slaveLatency, uint16_t supervisionTimeout);
    
    // GATT Server: Custom Services
    static unsigned int serviceCount();
    static BLEService service(unsigned int index);
    static bool addService(BLEService &service);
    static bool removeService(BLEService &service);

    // GAP: Authentication
    static bool setSecurity(BLESecurity security);
    static bool setBonding(bool bonding);
    static bool setPin(const char *pin);
    static void clearBondStorage();
    
    // GAP: Advertising
    static bool setIncludeTxPowerLevel(bool enable);
    static bool setIncludeConnectionInterval(bool enable);
    static bool setLocalName(const char *localName);
    static bool setAdvertisedServiceUuid(const char *uuid, bool complete = true);
    static bool setAdvertisedServiceUuids(const char *uuid[], int count, bool complete = true);
    static bool setManufacturerData(const uint8_t data[], int length);
    static bool setBeacon(const char *uuid, uint16_t major, uint16_t minor, int8_t rssi);
    static bool setAdvertisingData(const uint8_t data[], int length);
    static bool setScanResponseData(const uint8_t data[], int length);

    static bool setAdvertisingInterval(uint16_t advertisingInterval);
    static bool setAdvertisingInterval(uint16_t minimumAdvertisingInterval, uint16_t maximumAdvertisingInterval);
    static void setConnectable(bool connectable);
    static void setDiscoverable(BLEDiscoverable discoverable);

    static bool advertise();
    static void stopAdvertise();
    static bool advertising();
    
    // GAP: Peripheral 
    static BLEDevice central();
    static bool connected();
    static void disconnect();

    static void onStop(void(*callback)(void));
    static void onStop(Callback callback);
    static void onConnect(void(*callback)(void));
    static void onConnect(Callback callback);
    static void onDisconnect(void(*callback)(void));
    static void onDisconnect(Callback callback);

    // HCI: Test Mode
    static bool testTransmit(int channel, int length, BLEPayload payload, BLEPhy phy = BLE_PHY_1M);
    static bool testReceive(int channel, BLEPhy phy = BLE_PHY_1M, int modulation = 0);
    static uint32_t testStop();
    static bool testing();
};

extern BLEClass BLE;


enum BLEUartProtocol : uint8_t {
    BLE_UART_PROTOCOL_BLUEST = 0,
    BLE_UART_PROTOCOL_NORDIC,
    BLE_UART_PROTOCOL_HMSOFT
};

#define BLE_UART_RX_BUFFER_SIZE 128
#define BLE_UART_TX_BUFFER_SIZE 128

class BLEUart : public Stream, public BLEService {
public:
    BLEUart(BLEUartProtocol protocol);
    ~BLEUart();
    
    operator bool();

    int available() override;
    int peek() override;
    int read() override;
    int read(uint8_t *buffer, size_t size) override;

