GrumpyOldPizza/ArduinoCore-stm32wb/libraries/BLE/src/BLE.h
    int availableForWrite() override;
    size_t write(uint8_t data) override;
    size_t write(const uint8_t *buffer, size_t size) override;
    void flush() override;

    void setNonBlocking(bool enable);

    void onReceive(void(*callback)(void));
    void onReceive(Callback callback);
  
    using Print::write;
    
private:
    BLECharacteristic m_rx_characteristic;
    BLECharacteristic m_tx_characteristic;
    BLECharacteristic m_tx2_characteristic;

    uint8_t m_rx_data[BLE_UART_RX_BUFFER_SIZE];
    uint8_t m_tx_data[BLE_UART_TX_BUFFER_SIZE];
    volatile uint16_t m_rx_write;
    volatile uint16_t m_rx_read;
    volatile uint16_t m_rx_count;
    volatile uint16_t m_tx_write;
    volatile uint16_t m_tx_read;
    volatile uint16_t m_tx_count;
    volatile uint16_t m_tx_size;
    volatile uint8_t m_tx_busy;
    volatile uint8_t m_connected;

    const BLEUartProtocol m_protocol;
    uint8_t m_packet_size;
    uint8_t m_nonblocking;

    Callback m_receive_callback;

    void transmit();
    void receive();
    void connect();
};

#define BLE_OTA_QUEUE_SIZE       4096

enum BLEOtaOption : uint32_t {
    BLE_OTA_OPTION_TRIAL                                     = 0x00000001,
    BLE_OTA_OPTION_CANDIDATE                                 = 0x00000002,
    BLE_OTA_OPTION_WIRELESS                                  = 0x00000004,
};

enum BLEOtaState : uint8_t {
    BLE_OTA_STATE_READY                                      = 0x00,
    BLE_OTA_STATE_BUSY                                       = 0x01,
    BLE_OTA_STATE_FAILED                                     = 0x02,
    BLE_OTA_STATE_TRIAL                                      = 0x03,
    BLE_OTA_STATE_UPDATED                                    = 0x05,
};

class BLEOta : public BLEService {
public:
    BLEOta();
    BLEOta(const BLEOta&) = delete;
    BLEOta& operator=(const BLEOta&) = delete;

    bool begin(uint32_t options = 0);

    uint32_t state();

    void accept();
    void reject();
    void allow();
    void deny();
    void confirm();
    void cancel();

    void onStart(void(*callback)(void));
    void onStart(Callback callback);
    void onFinish(void(*callback)(void));
    void onFinish(Callback callback);
    
    
private:
    uint8_t                     m_busy;
    uint8_t                     m_state;
    uint8_t                     m_status;
    uint8_t                     m_protocol;
    uint8_t                     m_component;
    volatile uint8_t            m_deny;
    uint8_t                     m_options;
    volatile uint8_t            m_sequence;

    uint16_t                    m_head;
    uint16_t                    m_tail;
    uint32_t                    m_offset;
    uint32_t                    m_size;
    uint8_t                     m_data[BLE_OTA_QUEUE_SIZE];

    k_work_t                    m_work;
    stm32wb_fwu_request_t       m_request;

    BLECharacteristic           m_command_characteristic;
    BLECharacteristic           m_event_characteristic;
    BLECharacteristic           m_data_characteristic;

    Callback                    m_start_callback;
    Callback                    m_finish_callback;
    
    static void                 acceptCallback(class BLEOta *self);
    static void                 rejectCallback(class BLEOta *self);
    static void                 beginCallback(class BLEOta *self);
    static void                 startCallback(class BLEOta *self);
    static void                 writeCallback(class BLEOta *self);
    static void                 finishCallback(class BLEOta *self);
    static void                 confirmCallback(class BLEOta *self);
    static void                 rebootCallback();
    static void                 cancelCallback(class BLEOta *self);
    static void                 processCallback(class BLEOta *self);

    void                        connectCallback();
    void                        disconnectCallback();
    void                        commandCallback();
    void                        dataCallback();
    void                        countCallback();
};

#endif // BLE_H
